stardio/STM32_Ethercat_AGV/Appli/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "gfxmmu_lut.h"
#include "FreeRTOS.h"
#include "cmsis_os2.h"
#include "app_touchgfx.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdio.h>
#include <limits.h>
#include <stdlib.h>
#include <stdarg.h>
#include <string.h>
#include "settings_persistence.h"
#include "ui_flash_storage.h"
#include "stm32h7rsxx_hal_eth.h"
#include "soem/soem.h"
#include "osal.h"
#include "lan8742.h"
#include "soem_port.h"
#include "emw3080_web_server.h"
#include "task.h"  /* vTaskDelayUntil */
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* Non-blocking UART ring buffer for EtherCAT logging */
#define UART_LOG_BUF_SIZE 2048U
static volatile char uart_log_buf[UART_LOG_BUF_SIZE];
static volatile uint16_t uart_log_head = 0;  /* written by producer (EtherCAT task) */
static volatile uint16_t uart_log_tail = 0;  /* consumed by DMA/flush task */
static volatile uint8_t  uart_dma_busy = 0;  /* 1 = DMA transfer in flight */
static char uart_dma_chunk[256];  /* DMA source buffer in normal RAM */

/* Set to 1 while validating CN3 pin 2/3 short loopback, set back to 0 afterwards. */
#define WIFI_UART7_LOOPBACK_TEST 0
/* Set to 1 while validating SPI4 MOSI/MISO loopback in SPI bridge mode.
 * Validated route on STM32H7S78-DK: AF5 + SSOE.
 */
#define WIFI_SPI4_LOOPBACK_TEST 0
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

CRC_HandleTypeDef hcrc;

DMA2D_HandleTypeDef hdma2d;

GFXMMU_HandleTypeDef hgfxmmu;

GPU2D_HandleTypeDef hgpu2d;

I2C_HandleTypeDef hi2c1;

JPEG_HandleTypeDef hjpeg;
DMA_HandleTypeDef handle_HPDMA1_Channel1;
DMA_HandleTypeDef handle_HPDMA1_Channel0;

LTDC_HandleTypeDef hltdc;

UART_HandleTypeDef huart4;
UART_HandleTypeDef huart7;

ETH_HandleTypeDef heth;
/* DMA descriptors in RAM_CMD (0x24068000), MPU non-cacheable region.
 * ETH DMA uses AXI bus — cannot access SRAMAHB (AHB-only). Must stay in AXI SRAM. */
__ALIGN_BEGIN ETH_DMADescTypeDef DMARxDscrTab[ETH_RX_DESC_CNT] __ALIGN_END __attribute__((section(".eth_dma"), aligned(32)));
__ALIGN_BEGIN ETH_DMADescTypeDef DMATxDscrTab[ETH_TX_DESC_CNT] __ALIGN_END __attribute__((section(".eth_dma"), aligned(32)));

/* Debug status variables (shared with TouchGFX) */
volatile uint8_t g_ethLinkStatus = 0;
volatile uint8_t g_soemInitStatus = 0;
volatile uint8_t g_slaveCount = 0;
volatile uint32_t g_soemErrorCode = 0;

/* Debug counters from nicdrv.c */
extern volatile uint32_t g_soem_tx_count;
extern volatile uint32_t g_soem_tx_fail;
extern volatile uint32_t g_soem_rx_count;
extern volatile uint32_t g_soem_eth_state;
extern volatile uint32_t g_soem_setupnic_state;
extern volatile uint32_t g_soem_hal_status;
extern volatile uint32_t g_soem_eth_error;
extern volatile uint32_t g_soem_outframe_entry;
extern volatile uint32_t g_soem_outframe_step;
extern volatile uint32_t g_soem_txbuflength;

/* Debug counters from ec_base.c */
extern volatile uint32 g_soem_bwr_count;
extern volatile uint32 g_soem_brd_count;
extern volatile uint32 g_soem_getindex_count;
extern volatile uint32 g_soem_srconfirm_count;

/* Debug counters from ec_config.c */
extern volatile uint32 g_soem_config_init_entry;
extern volatile uint32 g_soem_detect_slaves_entry;
extern volatile uint32 g_soem_init_context_done;
extern volatile uint32 g_soem_detect_step;
extern volatile int g_soem_sockhandle_value;

/* Definitions for defaultTask */
osThreadId_t defaultTaskHandle;
const osThreadAttr_t defaultTask_attributes = {
  .name = "defaultTask",
  .stack_size = 1024 * 4,
  .priority = (osPriority_t) osPriorityBelowNormal,
};
/* Definitions for TouchGFXTask */
osThreadId_t TouchGFXTaskHandle;
const osThreadAttr_t TouchGFXTask_attributes = {
  .name = "TouchGFXTask",
  .stack_size = 4096 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
static void MPU_Config(void);
static void MX_GPIO_Init(void);
static void MX_HPDMA1_Init(void);
static void MX_LTDC_Init(void);
static void MX_CRC_Init(void);
static void MX_DMA2D_Init(void);
static void MX_JPEG_Init(void);
static void MX_FLASH_Init(void);
static void MX_I2C1_Init(void);
static void MX_UART4_Init(void);
static void MX_UART7_Init(void);
static void MX_GPU2D_Init(void);
static void MX_ICACHE_GPU2D_Init(void);
static void MX_GFXMMU_Init(void);
void StartDefaultTask(void *argument);
extern void TouchGFX_Task(void *argument);
static void MX_ETH_Init(void);

/* USER CODE BEGIN PFP */
void EtherCAT_Task(void *argument);
extern uint8_t TouchGFX_ModelReloadAllFromUiFlash(void);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
/* Non-blocking UART: push text into ring buffer, flushed by UART_LogFlush() */
static void UART4_SendText(const char *text)
{
  if (Emw3080WebServer_GetDiagActiveUart() == 4U && Emw3080WebServer_IsRunning() != 0U)
  {
    return;
  }
  if (text == NULL) return;
  uint16_t len = (uint16_t)strlen(text);
  for (uint16_t i = 0; i < len; i++)
  {
    uint16_t next = (uart_log_head + 1U) % UART_LOG_BUF_SIZE;
    if (next == uart_log_tail)
      break;  /* buffer full — drop oldest bytes silently */
    uart_log_buf[uart_log_head] = text[i];
    uart_log_head = next;
  }
}

