stardio/STM32_Ethercat_AGV/Appli/Core/Src/main.c
/* Flush ring buffer to UART via interrupt (call from low-priority context) */
static void UART_LogFlush(void)
{
  if (Emw3080WebServer_GetDiagActiveUart() == 4U && Emw3080WebServer_IsRunning() != 0U)
  {
    return;
  }
  if (uart_dma_busy) return;  /* previous transfer still in flight */
  uint16_t h = uart_log_head;
  uint16_t t = uart_log_tail;
  if (h == t) return;  /* nothing to send */

  /* Copy chunk out of ring buffer */
  uint16_t n = 0;
  while (t != h && n < sizeof(uart_dma_chunk))
  {
    uart_dma_chunk[n++] = uart_log_buf[t];
    t = (t + 1U) % UART_LOG_BUF_SIZE;
  }
  uart_log_tail = t;
  uart_dma_busy = 1;
  if (HAL_UART_Transmit_IT(&huart4, (uint8_t *)uart_dma_chunk, n) != HAL_OK)
  {
    /* IT not available — fall back to blocking */
    uart_dma_busy = 0;
    (void)HAL_UART_Transmit(&huart4, (uint8_t *)uart_dma_chunk, n, 50);
  }
}

#define PC_CMD_LINE_MAX 192U
#define PC_PROGRAM_POSITION_TOLERANCE 100
#define PC_PROGRAM_RETURN_TOLERANCE_HW 5
#define PC_UART_RX_RING_SIZE 512U
#define PC_HOME_DIAG_LOG_DEFAULT 0U

enum
{
  PC_PARAM_JOG_SPEED = 0,
  PC_PARAM_ACC_TIME,
  PC_PARAM_DEC_TIME,
  PC_PARAM_LIMIT_PLUS,
  PC_PARAM_LIMIT_MINUS,
  PC_PARAM_UNIT_SCALE,
  PC_PARAM_HOME_OFFSET,
  PC_PARAM_POSITION_GAIN,
  PC_PARAM_COUNT
};

enum
{
  PC_PROG_POS1 = 0,
  PC_PROG_POS2,
  PC_PROG_POS3,
  PC_PROG_SPEED1,
  PC_PROG_SPEED2,
  PC_PROG_SPEED3,
  PC_PROG_TORQUE1,
  PC_PROG_TORQUE2,
  PC_PROG_TORQUE3,
  PC_PROG_RETURN_SPEED,
  PC_PROG_DELAY_MS,
  PC_PROG_COUNT
};

typedef enum
{
  PC_SEQ_IDLE = 0,
  PC_SEQ_MOVE_STEP1,
  PC_SEQ_MOVE_STEP2,
  PC_SEQ_MOVE_STEP3,
  PC_SEQ_DELAY_BEFORE_RETURN,
  PC_SEQ_RETURN_TO_ORIGIN
} PcProgramSequenceState;

typedef struct
{
  int32_t manualPosition;
  int32_t manualSpeed;
  int16_t manualTorque;
  uint8_t manualAbsMode;
  int32_t parameterValues[PC_PARAM_COUNT];
  int32_t programValues[PC_PROG_COUNT];

  uint8_t parameterReadPending;
  uint32_t parameterReadStartMs;

  PcProgramSequenceState seqState;
  int32_t seqStepPositions[3];
  int32_t seqStepSpeeds[3];
  uint16_t seqStepTorques[3];
  int32_t seqOriginPosition;
  int32_t seqOriginPositionHw;
  int32_t seqActiveTarget;
  uint32_t seqDelayMs;
  uint32_t seqDelayStartMs;
} PcCommandContext;

static PcCommandContext g_pcCmd;
static char g_pcCmdLine[PC_CMD_LINE_MAX];
static uint16_t g_pcCmdLen = 0U;
static volatile uint8_t g_pcUartRxRing[PC_UART_RX_RING_SIZE];
static volatile uint16_t g_pcUartRxHead = 0U;
static volatile uint16_t g_pcUartRxTail = 0U;
static uint8_t g_pcUartRxByte = 0U;
static uint8_t g_pcHomeDiagLog = PC_HOME_DIAG_LOG_DEFAULT;

static void Pc_ProcessCommandLine(char *line);

static uint8_t Pc_ToLowerAscii(uint8_t c)
{
  if (c >= (uint8_t)'A' && c <= (uint8_t)'Z')
  {
    return (uint8_t)(c + ((uint8_t)'a' - (uint8_t)'A'));
  }
  return c;
}

static uint8_t Pc_StrEqIgnoreCase(const char *a, const char *b)
{
  if (a == NULL || b == NULL)
  {
    return 0U;
  }

  while (*a != '\0' && *b != '\0')
  {
    if (Pc_ToLowerAscii((uint8_t)*a) != Pc_ToLowerAscii((uint8_t)*b))
    {
      return 0U;
    }
    a++;
    b++;
  }

  return ((*a == '\0') && (*b == '\0')) ? 1U : 0U;
}

static uint8_t Pc_StartsWithIgnoreCase(const char *text, const char *prefix)
{
  if (text == NULL || prefix == NULL)
  {
    return 0U;
  }

  while (*prefix != '\0')
  {
    if (*text == '\0')
    {
      return 0U;
    }
    if (Pc_ToLowerAscii((uint8_t)*text) != Pc_ToLowerAscii((uint8_t)*prefix))
    {
      return 0U;
    }
    text++;
    prefix++;
  }
  return 1U;
}

static char* Pc_Trim(char *s)
{
  char *end;
  if (s == NULL)
  {
    return s;
  }

  while (*s == ' ' || *s == '\t')
  {
    s++;
  }

  end = s + strlen(s);
  while (end > s)
  {
    char c = *(end - 1);
    if (c != ' ' && c != '\t')
    {
      break;
    }
    end--;
  }
  *end = '\0';
  return s;
}

static int32_t Pc_ParseInt32(const char *text, int32_t fallback)
{
  char *endPtr = NULL;
  long parsed;
  if (text == NULL)
  {
    return fallback;
  }

  parsed = strtol(text, &endPtr, 10);
  if (endPtr == text)
  {
    return fallback;
  }
  if (parsed > INT32_MAX)
  {
    parsed = INT32_MAX;
  }
  else if (parsed < INT32_MIN)
  {
    parsed = INT32_MIN;
  }
  return (int32_t)parsed;
}

static uint8_t Pc_ParseBool(const char *text, uint8_t fallback)
{
  if (text == NULL)
  {
    return fallback;
  }

  if (Pc_StrEqIgnoreCase(text, "1") || Pc_StrEqIgnoreCase(text, "true") || Pc_StrEqIgnoreCase(text, "on"))
  {
    return 1U;
  }
  if (Pc_StrEqIgnoreCase(text, "0") || Pc_StrEqIgnoreCase(text, "false") || Pc_StrEqIgnoreCase(text, "off"))
  {
    return 0U;
  }

  return fallback;
}

static int32_t Pc_AbsMin1(int32_t value)
{
  int32_t absValue = value;
  if (absValue < 0)
  {
    absValue = -absValue;
  }
  if (absValue <= 0)
  {
    absValue = 1;
  }
  return absValue;
}

static uint16_t Pc_ClampTorquePercent(int32_t value)
{
  int32_t absValue = Pc_AbsMin1(value);
  if (absValue > 100)
  {
    absValue = 100;
  }
  return (uint16_t)absValue;
}

static void Pc_CmdReply(const char *fmt, ...)
{
  char msg[192];
  va_list args;
  int len;

  va_start(args, fmt);
  len = vsnprintf(msg, sizeof(msg), fmt, args);
  va_end(args);

  if (len < 0)
  {
    return;
  }

  if (len >= (int)sizeof(msg))
  {
    len = (int)sizeof(msg) - 1;
    msg[len] = '\0';
  }

  UART4_SendText(msg);
  UART4_SendText("\r\n");
}

static void Pc_HomeDiagLog(const char *tag)
{
  if (g_pcHomeDiagLog == 0U)
  {
    return;
  }

  Pc_CmdReply("[HOME_DIAG] tag=%s cur_u=%ld cur_hw=%ld home_hw=%ld home_user=%ld unit=%ld",
              (tag != NULL) ? tag : "?",
              (long)SOEM_GetPositionActual(),
              (long)SOEM_GetPositionActualHw(),
              (long)SOEM_GetHomeOffset(),
              (long)g_pcCmd.parameterValues[PC_PARAM_HOME_OFFSET],
              (long)g_pcCmd.parameterValues[PC_PARAM_UNIT_SCALE]);
}

static void Pc_ReplyConfigSnapshot(void)
{
  Pc_CmdReply("CFGM,pos=%ld,speed=%ld,torque=%d,abs=%u",
              (long)g_pcCmd.manualPosition,
              (long)g_pcCmd.manualSpeed,
              (int)g_pcCmd.manualTorque,
              (unsigned int)g_pcCmd.manualAbsMode);

  Pc_CmdReply("CFGP,jog=%ld,acc=%ld,dec=%ld,lplus=%ld,lminus=%ld,unit=%ld,home=%ld,gain=%ld",
              (long)g_pcCmd.parameterValues[PC_PARAM_JOG_SPEED],
              (long)g_pcCmd.parameterValues[PC_PARAM_ACC_TIME],
              (long)g_pcCmd.parameterValues[PC_PARAM_DEC_TIME],
              (long)g_pcCmd.parameterValues[PC_PARAM_LIMIT_PLUS],
              (long)g_pcCmd.parameterValues[PC_PARAM_LIMIT_MINUS],
              (long)g_pcCmd.parameterValues[PC_PARAM_UNIT_SCALE],
              (long)g_pcCmd.parameterValues[PC_PARAM_HOME_OFFSET],
              (long)g_pcCmd.parameterValues[PC_PARAM_POSITION_GAIN]);

  Pc_CmdReply("CFGR,p1=%ld,p2=%ld,p3=%ld,s1=%ld,s2=%ld,s3=%ld,t1=%ld,t2=%ld,t3=%ld,rs=%ld,delay=%ld",
              (long)g_pcCmd.programValues[PC_PROG_POS1],
              (long)g_pcCmd.programValues[PC_PROG_POS2],
              (long)g_pcCmd.programValues[PC_PROG_POS3],
              (long)g_pcCmd.programValues[PC_PROG_SPEED1],
              (long)g_pcCmd.programValues[PC_PROG_SPEED2],
              (long)g_pcCmd.programValues[PC_PROG_SPEED3],
              (long)g_pcCmd.programValues[PC_PROG_TORQUE1],
              (long)g_pcCmd.programValues[PC_PROG_TORQUE2],
              (long)g_pcCmd.programValues[PC_PROG_TORQUE3],
              (long)g_pcCmd.programValues[PC_PROG_RETURN_SPEED],
              (long)g_pcCmd.programValues[PC_PROG_DELAY_MS]);
}

static void Pc_SyncTouchGfxModel(void)
{
  (void)TouchGFX_ModelReloadAllFromUiFlash();
}

static void Pc_SaveManualToFlash(void)
{
  UiFlashManualData manualData;
  manualData.position = g_pcCmd.manualPosition;
  manualData.speed = g_pcCmd.manualSpeed;
  manualData.torque = g_pcCmd.manualTorque;
  manualData.absMode = g_pcCmd.manualAbsMode;
  memset(manualData.reserved, 0, sizeof(manualData.reserved));
  (void)UiFlashStorage_SaveManual(&manualData);
}

static void Pc_SaveParameterToFlash(void)
{
  UiFlashParameterData parameterData;
  uint8_t i;
  for (i = 0U; i < PC_PARAM_COUNT; i++)
  {
    parameterData.values[i] = g_pcCmd.parameterValues[i];
  }
  (void)UiFlashStorage_SaveParameter(&parameterData);
}

static void Pc_SaveProgramToFlash(void)
{
  UiFlashProgramData programData;
  uint8_t i;
  for (i = 0U; i < PC_PROG_COUNT; i++)
  {
    programData.values[i] = g_pcCmd.programValues[i];
  }
  (void)UiFlashStorage_SaveProgram(&programData);
}

static uint8_t Pc_IsMotionEnabled(void)
{
  const uint16_t statusword = SOEM_GetStatusword();
  if (SOEM_GetPdoReady() == 0U)
  {
    return 0U;
  }
  if (SOEM_GetRunEnable() == 0U)
  {
    return 0U;
  }
  return (((statusword & 0x006FU) == 0x0027U) ? 1U : 0U);
}

