stardio/STM32_Ethercat_AGV/Appli/Core/Src/main.c
static uint8_t Pc_IsTargetReached(int32_t target)
{
  int64_t delta = (int64_t)SOEM_GetPositionActual() - (int64_t)target;
  if (delta < 0)
  {
    delta = -delta;
  }
  return (delta <= (int64_t)PC_PROGRAM_POSITION_TOLERANCE) ? 1U : 0U;
}

static uint8_t Pc_IsHardwareTargetReached(int32_t targetHw, int32_t toleranceHw)
{
  int32_t tolerance = toleranceHw;
  int64_t delta;
  if (tolerance < 0)
  {
    tolerance = -tolerance;
  }

  delta = (int64_t)SOEM_GetPositionActualHw() - (int64_t)targetHw;
  if (delta < 0)
  {
    delta = -delta;
  }
  return (delta <= (int64_t)tolerance) ? 1U : 0U;
}

static int32_t Pc_ClampInt64ToInt32(int64_t value)
{
  if (value > (int64_t)INT32_MAX)
  {
    return INT32_MAX;
  }
  if (value < (int64_t)INT32_MIN)
  {
    return INT32_MIN;
  }
  return (int32_t)value;
}

static void Pc_ProgramStop(void)
{
  if (g_pcCmd.seqState == PC_SEQ_IDLE)
  {
    return;
  }

  SOEM_SetTargetPositionAbs(SOEM_GetPositionActual());
  g_pcCmd.seqState = PC_SEQ_IDLE;
  g_pcCmd.seqDelayStartMs = 0U;
}

static void Pc_ProgramBeginStep(uint8_t stepIndex)
{
  if (stepIndex >= 3U)
  {
    return;
  }

  SOEM_SetProfileVelocity(g_pcCmd.seqStepSpeeds[stepIndex]);
  SOEM_SetTorqueLimitPercent(g_pcCmd.seqStepTorques[stepIndex]);
  g_pcCmd.seqActiveTarget = g_pcCmd.seqStepPositions[stepIndex];
  SOEM_SetTargetPositionAbs(g_pcCmd.seqActiveTarget);

  if (stepIndex == 0U)
  {
    g_pcCmd.seqState = PC_SEQ_MOVE_STEP1;
  }
  else if (stepIndex == 1U)
  {
    g_pcCmd.seqState = PC_SEQ_MOVE_STEP2;
  }
  else
  {
    g_pcCmd.seqState = PC_SEQ_MOVE_STEP3;
  }
}

static uint8_t Pc_ProgramStart(void)
{
  uint8_t i;
  int32_t delayValue;

  if (g_pcCmd.seqState != PC_SEQ_IDLE)
  {
    return 0U;
  }
  if (Pc_IsMotionEnabled() == 0U)
  {
    return 0U;
  }

  for (i = 0U; i < 3U; i++)
  {
    g_pcCmd.seqStepPositions[i] = g_pcCmd.programValues[PC_PROG_POS1 + i];
    g_pcCmd.seqStepSpeeds[i] = Pc_AbsMin1(g_pcCmd.programValues[PC_PROG_SPEED1 + i]);
    g_pcCmd.seqStepTorques[i] = Pc_ClampTorquePercent(g_pcCmd.programValues[PC_PROG_TORQUE1 + i]);
  }

  delayValue = g_pcCmd.programValues[PC_PROG_DELAY_MS];
  g_pcCmd.seqDelayMs = (delayValue > 0) ? (uint32_t)delayValue : 0U;

  g_pcCmd.seqOriginPosition = SOEM_GetPositionActual();
  g_pcCmd.seqOriginPositionHw = SOEM_GetPositionActualHw();
  g_pcCmd.seqDelayStartMs = 0U;

  Pc_ProgramBeginStep(0U);
  return 1U;
}

static void Pc_ProgramTick(void)
{
  if (g_pcCmd.seqState == PC_SEQ_IDLE)
  {
    return;
  }

  if (SOEM_GetRunEnable() == 0U)
  {
    Pc_ProgramStop();
    return;
  }

  if (g_pcCmd.seqState == PC_SEQ_MOVE_STEP1)
  {
    if (Pc_IsTargetReached(g_pcCmd.seqActiveTarget) != 0U)
    {
      Pc_ProgramBeginStep(1U);
    }
    return;
  }

  if (g_pcCmd.seqState == PC_SEQ_MOVE_STEP2)
  {
    if (Pc_IsTargetReached(g_pcCmd.seqActiveTarget) != 0U)
    {
      Pc_ProgramBeginStep(2U);
    }
    return;
  }

  if (g_pcCmd.seqState == PC_SEQ_MOVE_STEP3)
  {
    if (Pc_IsTargetReached(g_pcCmd.seqActiveTarget) != 0U)
    {
      g_pcCmd.seqDelayStartMs = HAL_GetTick();
      g_pcCmd.seqState = PC_SEQ_DELAY_BEFORE_RETURN;
    }
    return;
  }

  if (g_pcCmd.seqState == PC_SEQ_DELAY_BEFORE_RETURN)
  {
    uint32_t elapsed = HAL_GetTick() - g_pcCmd.seqDelayStartMs;
    if (elapsed >= g_pcCmd.seqDelayMs)
    {
      const int32_t returnSpeed = Pc_AbsMin1(g_pcCmd.programValues[PC_PROG_RETURN_SPEED]);
      SOEM_SetProfileVelocity(returnSpeed);
      SOEM_SetTorqueLimitPercent(g_pcCmd.seqStepTorques[2]);
      g_pcCmd.seqActiveTarget = g_pcCmd.seqOriginPosition;
      SOEM_SetTargetPositionAbsHw(g_pcCmd.seqOriginPositionHw);
      g_pcCmd.seqState = PC_SEQ_RETURN_TO_ORIGIN;
    }
    return;
  }

  if (g_pcCmd.seqState == PC_SEQ_RETURN_TO_ORIGIN)
  {
    if (Pc_IsHardwareTargetReached(g_pcCmd.seqOriginPositionHw, PC_PROGRAM_RETURN_TOLERANCE_HW) != 0U)
    {
      g_pcCmd.seqState = PC_SEQ_IDLE;
      g_pcCmd.seqDelayStartMs = 0U;
    }
  }
}

static void Pc_ApplyParametersToDrive(void)
{
  int32_t jogSpeed = g_pcCmd.parameterValues[PC_PARAM_JOG_SPEED];
  int32_t acc = g_pcCmd.parameterValues[PC_PARAM_ACC_TIME];
  int32_t dec = g_pcCmd.parameterValues[PC_PARAM_DEC_TIME];
  int32_t unitScale = g_pcCmd.parameterValues[PC_PARAM_UNIT_SCALE];
  int32_t posGain = g_pcCmd.parameterValues[PC_PARAM_POSITION_GAIN];

  if (jogSpeed < 0)
  {
    jogSpeed = -jogSpeed;
  }
  if (jogSpeed <= 0)
  {
    jogSpeed = 1;
  }
  if (acc < 0)
  {
    acc = -acc;
  }
  if (dec < 0)
  {
    dec = -dec;
  }
  if (unitScale <= 0)
  {
    unitScale = 1;
  }
  if (posGain < 0)
  {
    posGain = 0;
  }

  g_pcCmd.parameterValues[PC_PARAM_JOG_SPEED] = jogSpeed;
  g_pcCmd.parameterValues[PC_PARAM_ACC_TIME] = acc;
  g_pcCmd.parameterValues[PC_PARAM_DEC_TIME] = dec;
  g_pcCmd.parameterValues[PC_PARAM_UNIT_SCALE] = unitScale;
  g_pcCmd.parameterValues[PC_PARAM_POSITION_GAIN] = posGain;

  SOEM_SetProfileVelocity(jogSpeed);
  SOEM_SetProfileAcceleration(acc);
  SOEM_SetProfileDeceleration(dec);
  SOEM_SetUnitScale(unitScale);
  SOEM_SetSoftwareLimitPlus(g_pcCmd.parameterValues[PC_PARAM_LIMIT_PLUS]);
  SOEM_SetSoftwareLimitMinus(g_pcCmd.parameterValues[PC_PARAM_LIMIT_MINUS]);
  SOEM_SetPositionGain(posGain);
  Pc_HomeDiagLog("apply_params");
}

static void Pc_CommandInit(void)
{
  UiFlashManualData manualData;
  UiFlashParameterData parameterData;
  UiFlashProgramData programData;
  int32_t savedHomeHwOffset = 0;
  uint8_t i;

  memset(&g_pcCmd, 0, sizeof(g_pcCmd));
  g_pcCmd.manualAbsMode = 1U;
  g_pcCmd.parameterValues[PC_PARAM_UNIT_SCALE] = 1;
  g_pcCmd.programValues[PC_PROG_RETURN_SPEED] = 100;
  g_pcCmd.seqState = PC_SEQ_IDLE;

  if (UiFlashStorage_LoadManual(&manualData) != 0U)
  {
    g_pcCmd.manualPosition = manualData.position;
    g_pcCmd.manualSpeed = manualData.speed;
    g_pcCmd.manualTorque = manualData.torque;
    g_pcCmd.manualAbsMode = (manualData.absMode != 0U) ? 1U : 0U;
  }

  if (UiFlashStorage_LoadParameter(&parameterData) != 0U)
  {
    for (i = 0U; i < PC_PARAM_COUNT; i++)
    {
      g_pcCmd.parameterValues[i] = parameterData.values[i];
    }
  }

  if (UiFlashStorage_LoadProgram(&programData) != 0U)
  {
    for (i = 0U; i < PC_PROG_COUNT; i++)
    {
      g_pcCmd.programValues[i] = programData.values[i];
    }
  }

  /* Restore saved home origin at boot so absolute/user position remains calibrated
   * after power cycle, independent of TouchGFX model startup timing. */
  if (UiFlashStorage_LoadHome(&savedHomeHwOffset) != 0U)
  {
    SOEM_LoadHomeHwOffset(savedHomeHwOffset);
  }
}

