stardio/STM32_Ethercat_AGV/Appli/Core/Src/main.c
static void Pc_CommandHandleByte(uint8_t ch)
{
  if (ch == (uint8_t)'\r')
  {
    return;
  }

  if (ch == (uint8_t)'\n')
  {
    g_pcCmdLine[g_pcCmdLen] = '\0';
    if (g_pcCmdLen > 0U)
    {
      Pc_ProcessCommandLine(g_pcCmdLine);
    }
    g_pcCmdLen = 0U;
    return;
  }

  if (g_pcCmdLen < (PC_CMD_LINE_MAX - 1U))
  {
    g_pcCmdLine[g_pcCmdLen++] = (char)ch;
  }
  else
  {
    g_pcCmdLen = 0U;
  }
}

static void Pc_CommandEnsureRxArmed(void)
{
  if (huart4.RxState == HAL_UART_STATE_READY)
  {
    (void)HAL_UART_Receive_IT(&huart4, &g_pcUartRxByte, 1U);
  }
}

static void Pc_ProcessCommandLine(char *line)
{
  char *payload = Pc_Trim(line);
  char *eq;
  char *key;
  char *value;
  int32_t parsed;

  if (payload == NULL || *payload == '\0')
  {
    return;
  }

  if (Pc_StartsWithIgnoreCase(payload, "CMD,"))
  {
    payload += 4;
  }

  eq = strchr(payload, '=');
  if (eq == NULL)
  {
    return;
  }

  *eq = '\0';
  key = Pc_Trim(payload);
  value = Pc_Trim(eq + 1);

  if (Pc_StrEqIgnoreCase(key, "run"))
  {
    uint8_t runEnable = Pc_ParseBool(value, 0U);
    char msg[64];
    SOEM_SetRunEnable(runEnable);
    (void)snprintf(msg, sizeof(msg), "[CMD] run request=%u applied=%u", (unsigned int)runEnable, (unsigned int)SOEM_GetRunEnable());
    Pc_CmdReply(msg);
    if (runEnable == 0U)
    {
      Pc_ProgramStop();
    }
    return;
  }

  if (Pc_StrEqIgnoreCase(key, "diag_home_log"))
  {
    g_pcHomeDiagLog = Pc_ParseBool(value, g_pcHomeDiagLog);
    Pc_CmdReply("[CMD] diag_home_log=%u", (unsigned int)g_pcHomeDiagLog);
    Pc_HomeDiagLog("diag_toggle");
    return;
  }

  if (Pc_StrEqIgnoreCase(key, "jog_delta"))
  {
    parsed = Pc_ParseInt32(value, 0);
    if (Pc_IsMotionEnabled() != 0U)
    {
      SOEM_SetTargetPositionDelta(parsed);
    }
    return;
  }

  if (Pc_StrEqIgnoreCase(key, "target_delta"))
  {
    parsed = Pc_ParseInt32(value, 0);
    g_pcCmd.manualPosition = parsed;
    if (Pc_IsMotionEnabled() != 0U)
    {
      SOEM_SetTargetPositionDelta(parsed);
    }
    return;
  }

  if (Pc_StrEqIgnoreCase(key, "target_abs"))
  {
    parsed = Pc_ParseInt32(value, SOEM_GetPositionActual());
    g_pcCmd.manualPosition = parsed;
    SOEM_SetTargetPositionAbs(parsed);
    return;
  }

  if (Pc_StrEqIgnoreCase(key, "set_home"))
  {
    if (Pc_ParseBool(value, 0U) != 0U)
    {
      int32_t unitScale = g_pcCmd.parameterValues[PC_PARAM_UNIT_SCALE];
      int32_t homeOffsetUser = g_pcCmd.parameterValues[PC_PARAM_HOME_OFFSET];
      int64_t desiredHomeHw;
      int32_t homeOffsetHw;

      if (unitScale <= 0)
      {
        unitScale = 1;
        g_pcCmd.parameterValues[PC_PARAM_UNIT_SCALE] = unitScale;
      }

      /* User intent: after Set Home,
       * CurrentPosition(user) = 0 + HomeOffset(user).
       * With user = (actualHw - homeHw) / scale,
       * choose homeHw = actualHw - HomeOffset(user) * scale. */
      desiredHomeHw = (int64_t)SOEM_GetPositionActualHw() -
                      ((int64_t)homeOffsetUser * (int64_t)unitScale);
      homeOffsetHw = Pc_ClampInt64ToInt32(desiredHomeHw);

      SOEM_LoadHomeHwOffset(homeOffsetHw);
      (void)UiFlashStorage_SaveHome(homeOffsetHw);
      Pc_SaveParameterToFlash();
      Pc_HomeDiagLog("set_home");
    }
    return;
  }

  if (Pc_StrEqIgnoreCase(key, "manual_speed"))
  {
    parsed = Pc_AbsMin1(Pc_ParseInt32(value, g_pcCmd.manualSpeed));
    g_pcCmd.manualSpeed = parsed;
    SOEM_SetProfileVelocity(parsed);
    return;
  }

  if (Pc_StrEqIgnoreCase(key, "manual_torque"))
  {
    uint16_t tq = Pc_ClampTorquePercent(Pc_ParseInt32(value, (int32_t)g_pcCmd.manualTorque));
    g_pcCmd.manualTorque = (int16_t)tq;
    SOEM_SetTorqueLimitPercent(tq);
    return;
  }

  if (Pc_StrEqIgnoreCase(key, "manual_abs"))
  {
    g_pcCmd.manualAbsMode = Pc_ParseBool(value, g_pcCmd.manualAbsMode);
    return;
  }

  if (Pc_StrEqIgnoreCase(key, "manual_pos"))
  {
    g_pcCmd.manualPosition = Pc_ParseInt32(value, g_pcCmd.manualPosition);
    return;
  }

  if (Pc_StrEqIgnoreCase(key, "manual_apply"))
  {
    if (Pc_ParseBool(value, 0U) != 0U)
    {
      Pc_SaveManualToFlash();
      Pc_SyncTouchGfxModel();
      Pc_ReplyConfigSnapshot();
    }
    return;
  }

  if (Pc_StrEqIgnoreCase(key, "manual_stop"))
  {
    if (Pc_ParseBool(value, 0U) != 0U)
    {
      SOEM_SetTargetPositionAbs(SOEM_GetPositionActual());
      Pc_ProgramStop();
    }
    return;
  }

  if (Pc_StrEqIgnoreCase(key, "manual_save"))
  {
    if (Pc_ParseBool(value, 0U) != 0U)
    {
      Pc_SaveManualToFlash();
      Pc_SyncTouchGfxModel();
      Pc_ReplyConfigSnapshot();
    }
    return;
  }

  if (Pc_StrEqIgnoreCase(key, "manual_load"))
  {
    if (Pc_ParseBool(value, 0U) != 0U)
    {
      UiFlashManualData manualData;
      if (UiFlashStorage_LoadManual(&manualData) != 0U)
      {
        g_pcCmd.manualPosition = manualData.position;
        g_pcCmd.manualSpeed = Pc_AbsMin1(manualData.speed);
        g_pcCmd.manualTorque = (int16_t)Pc_ClampTorquePercent((int32_t)manualData.torque);
        g_pcCmd.manualAbsMode = (manualData.absMode != 0U) ? 1U : 0U;
        SOEM_SetProfileVelocity(g_pcCmd.manualSpeed);
        SOEM_SetTorqueLimitPercent((uint16_t)g_pcCmd.manualTorque);
        Pc_SyncTouchGfxModel();
        Pc_ReplyConfigSnapshot();
      }
    }
    return;
  }

  if (Pc_StrEqIgnoreCase(key, "param_jog_speed"))         { g_pcCmd.parameterValues[PC_PARAM_JOG_SPEED] = Pc_ParseInt32(value, g_pcCmd.parameterValues[PC_PARAM_JOG_SPEED]); return; }
  if (Pc_StrEqIgnoreCase(key, "param_acc"))               { g_pcCmd.parameterValues[PC_PARAM_ACC_TIME] = Pc_ParseInt32(value, g_pcCmd.parameterValues[PC_PARAM_ACC_TIME]); return; }
  if (Pc_StrEqIgnoreCase(key, "param_dec"))               { g_pcCmd.parameterValues[PC_PARAM_DEC_TIME] = Pc_ParseInt32(value, g_pcCmd.parameterValues[PC_PARAM_DEC_TIME]); return; }
  if (Pc_StrEqIgnoreCase(key, "param_limit_plus"))        { g_pcCmd.parameterValues[PC_PARAM_LIMIT_PLUS] = Pc_ParseInt32(value, g_pcCmd.parameterValues[PC_PARAM_LIMIT_PLUS]); return; }
  if (Pc_StrEqIgnoreCase(key, "param_limit_minus"))       { g_pcCmd.parameterValues[PC_PARAM_LIMIT_MINUS] = Pc_ParseInt32(value, g_pcCmd.parameterValues[PC_PARAM_LIMIT_MINUS]); return; }
  if (Pc_StrEqIgnoreCase(key, "param_unit_scale"))        { g_pcCmd.parameterValues[PC_PARAM_UNIT_SCALE] = Pc_ParseInt32(value, g_pcCmd.parameterValues[PC_PARAM_UNIT_SCALE]); return; }
    if (Pc_StrEqIgnoreCase(key, "param_home_offset"))       { g_pcCmd.parameterValues[PC_PARAM_HOME_OFFSET] = Pc_ParseInt32(value, g_pcCmd.parameterValues[PC_PARAM_HOME_OFFSET]); return; }
  if (Pc_StrEqIgnoreCase(key, "param_position_gain"))     { g_pcCmd.parameterValues[PC_PARAM_POSITION_GAIN] = Pc_ParseInt32(value, g_pcCmd.parameterValues[PC_PARAM_POSITION_GAIN]); return; }

