stardio/STM32_Ethercat_AGV/Appli/Core/Src/main.c
  if (Pc_StrEqIgnoreCase(key, "param_write_all"))
  {
    if (Pc_ParseBool(value, 0U) != 0U)
    {
      Pc_ApplyParametersToDrive();
      Pc_HomeDiagLog("param_write_all");
      Pc_ReplyConfigSnapshot();
    }
    return;
  }

  if (Pc_StrEqIgnoreCase(key, "param_apply"))
  {
    if (Pc_ParseBool(value, 0U) != 0U)
    {
      Pc_ApplyParametersToDrive();
      Pc_HomeDiagLog("param_apply");
      Pc_SaveParameterToFlash();
      Pc_SyncTouchGfxModel();
      Pc_ReplyConfigSnapshot();
    }
    return;
  }

  if (Pc_StrEqIgnoreCase(key, "cfg_read"))
  {
    if (Pc_ParseBool(value, 0U) != 0U)
    {
      SOEM_RequestParameterReadAll();
      g_pcCmd.parameterReadPending = 1U;
      g_pcCmd.parameterReadStartMs = HAL_GetTick();
      Pc_ReplyConfigSnapshot();
    }
    return;
  }

  if (Pc_StrEqIgnoreCase(key, "param_read_all"))
  {
    if (Pc_ParseBool(value, 0U) != 0U)
    {
      SOEM_RequestParameterReadAll();
      g_pcCmd.parameterReadPending = 1U;
      g_pcCmd.parameterReadStartMs = HAL_GetTick();
    }
    return;
  }

  if (Pc_StrEqIgnoreCase(key, "param_save"))
  {
    if (Pc_ParseBool(value, 0U) != 0U)
    {
      Pc_SaveParameterToFlash();
      Pc_SyncTouchGfxModel();
      Pc_ReplyConfigSnapshot();
    }
    return;
  }

  if (Pc_StrEqIgnoreCase(key, "param_load"))
  {
    if (Pc_ParseBool(value, 0U) != 0U)
    {
      UiFlashParameterData parameterData;
      uint8_t i;
      if (UiFlashStorage_LoadParameter(&parameterData) != 0U)
      {
        for (i = 0U; i < PC_PARAM_COUNT; i++)
        {
          g_pcCmd.parameterValues[i] = parameterData.values[i];
        }
        Pc_SyncTouchGfxModel();
        Pc_ReplyConfigSnapshot();
      }
    }
    return;
  }

  if (Pc_StrEqIgnoreCase(key, "prog_pos1"))          { g_pcCmd.programValues[PC_PROG_POS1] = Pc_ParseInt32(value, g_pcCmd.programValues[PC_PROG_POS1]); return; }
  if (Pc_StrEqIgnoreCase(key, "prog_pos2"))          { g_pcCmd.programValues[PC_PROG_POS2] = Pc_ParseInt32(value, g_pcCmd.programValues[PC_PROG_POS2]); return; }
  if (Pc_StrEqIgnoreCase(key, "prog_pos3"))          { g_pcCmd.programValues[PC_PROG_POS3] = Pc_ParseInt32(value, g_pcCmd.programValues[PC_PROG_POS3]); return; }
  if (Pc_StrEqIgnoreCase(key, "prog_speed1"))        { g_pcCmd.programValues[PC_PROG_SPEED1] = Pc_ParseInt32(value, g_pcCmd.programValues[PC_PROG_SPEED1]); return; }
  if (Pc_StrEqIgnoreCase(key, "prog_speed2"))        { g_pcCmd.programValues[PC_PROG_SPEED2] = Pc_ParseInt32(value, g_pcCmd.programValues[PC_PROG_SPEED2]); return; }
  if (Pc_StrEqIgnoreCase(key, "prog_speed3"))        { g_pcCmd.programValues[PC_PROG_SPEED3] = Pc_ParseInt32(value, g_pcCmd.programValues[PC_PROG_SPEED3]); return; }
  if (Pc_StrEqIgnoreCase(key, "prog_torque1"))       { g_pcCmd.programValues[PC_PROG_TORQUE1] = Pc_ParseInt32(value, g_pcCmd.programValues[PC_PROG_TORQUE1]); return; }
  if (Pc_StrEqIgnoreCase(key, "prog_torque2"))       { g_pcCmd.programValues[PC_PROG_TORQUE2] = Pc_ParseInt32(value, g_pcCmd.programValues[PC_PROG_TORQUE2]); return; }
  if (Pc_StrEqIgnoreCase(key, "prog_torque3"))       { g_pcCmd.programValues[PC_PROG_TORQUE3] = Pc_ParseInt32(value, g_pcCmd.programValues[PC_PROG_TORQUE3]); return; }
  if (Pc_StrEqIgnoreCase(key, "prog_return_speed"))  { g_pcCmd.programValues[PC_PROG_RETURN_SPEED] = Pc_ParseInt32(value, g_pcCmd.programValues[PC_PROG_RETURN_SPEED]); return; }
  if (Pc_StrEqIgnoreCase(key, "prog_delay_ms"))      { g_pcCmd.programValues[PC_PROG_DELAY_MS] = Pc_ParseInt32(value, g_pcCmd.programValues[PC_PROG_DELAY_MS]); return; }

  if (Pc_StrEqIgnoreCase(key, "program_save"))
  {
    if (Pc_ParseBool(value, 0U) != 0U)
    {
      Pc_SaveProgramToFlash();
      Pc_SyncTouchGfxModel();
      Pc_ReplyConfigSnapshot();
    }
    return;
  }

  if (Pc_StrEqIgnoreCase(key, "program_apply"))
  {
    if (Pc_ParseBool(value, 0U) != 0U)
    {
      Pc_SaveProgramToFlash();
      Pc_SyncTouchGfxModel();
      Pc_ReplyConfigSnapshot();
    }
    return;
  }

  if (Pc_StrEqIgnoreCase(key, "program_load"))
  {
    if (Pc_ParseBool(value, 0U) != 0U)
    {
      UiFlashProgramData programData;
      uint8_t i;
      if (UiFlashStorage_LoadProgram(&programData) != 0U)
      {
        for (i = 0U; i < PC_PROG_COUNT; i++)
        {
          g_pcCmd.programValues[i] = programData.values[i];
        }
        Pc_SyncTouchGfxModel();
        Pc_ReplyConfigSnapshot();
      }
    }
    return;
  }

  if (Pc_StrEqIgnoreCase(key, "program_start"))
  {
    if (Pc_ParseBool(value, 0U) != 0U)
    {
      if (Pc_ProgramStart() == 0U)
      {
        Pc_CmdReply("[CMD] program_start rejected");
      }
    }
    return;
  }

  if (Pc_StrEqIgnoreCase(key, "program_stop"))
  {
    if (Pc_ParseBool(value, 0U) != 0U)
    {
      Pc_ProgramStop();
    }
    return;
  }

  {
    char msg[96];
    (void)snprintf(msg, sizeof(msg), "[CMD] unknown key=%s", (key != NULL) ? key : "?");
    Pc_CmdReply(msg);
  }
}

static void Pc_CommandPollUart(void)
{
  uint8_t ch;

  while (g_pcUartRxTail != g_pcUartRxHead)
  {
    ch = g_pcUartRxRing[g_pcUartRxTail];
    g_pcUartRxTail = (uint16_t)((g_pcUartRxTail + 1U) % PC_UART_RX_RING_SIZE);
    Pc_CommandHandleByte(ch);
  }

  while (HAL_UART_Receive(&huart4, &ch, 1U, 0U) == HAL_OK)
  {
    Pc_CommandHandleByte(ch);
  }

  Pc_CommandEnsureRxArmed();
}

static void Pc_CommandTick(void)
{
  if (g_pcCmd.parameterReadPending != 0U)
  {
    int32_t values[UI_FLASH_PARAMETER_VALUE_COUNT] = {0};
    if (SOEM_FetchParameterReadAll(values, UI_FLASH_PARAMETER_VALUE_COUNT) != 0U)
    {
      g_pcCmd.parameterValues[PC_PARAM_ACC_TIME] = values[1];
      g_pcCmd.parameterValues[PC_PARAM_DEC_TIME] = values[2];
      g_pcCmd.parameterValues[PC_PARAM_LIMIT_PLUS] = values[3];
      g_pcCmd.parameterValues[PC_PARAM_LIMIT_MINUS] = values[4];
      g_pcCmd.parameterValues[PC_PARAM_UNIT_SCALE] = values[5];
      g_pcCmd.parameterValues[PC_PARAM_POSITION_GAIN] = values[7];
      g_pcCmd.parameterReadPending = 0U;
      Pc_HomeDiagLog("param_read_all");
      Pc_SaveParameterToFlash();
      Pc_SyncTouchGfxModel();
      Pc_CmdReply("[CMD] param_read_all ok");
      Pc_ReplyConfigSnapshot();
    }
    else if ((HAL_GetTick() - g_pcCmd.parameterReadStartMs) > 1800U)
    {
      g_pcCmd.parameterReadPending = 0U;
      Pc_CmdReply("[CMD] param_read_all timeout");
    }
  }

