stardio/STM32_Ethercat_AGV/Appli/Core/Src/main.c
  Pc_ProgramTick();
}

static void WIFI_UART7_LoopbackSelfTest(void)
{
#if WIFI_UART7_LOOPBACK_TEST
  static const uint8_t txPattern[] = {'A', 'T', '\r', '\n'};
  uint8_t rxByte = 0U;
  uint8_t rxCapture[8] = {0};
  uint32_t rxCount = 0U;
  uint32_t txOk = 0U;
  uint32_t pass = 0U;
  uint32_t start = 0U;
  char msg[160];

  /* Drain stale UART7 bytes first. */
  for (uint32_t i = 0U; i < 32U; i++)
  {
    if (HAL_UART_Receive(&huart7, &rxByte, 1U, 2U) != HAL_OK)
    {
      break;
    }
  }

  if (HAL_UART_Transmit(&huart7, (uint8_t*)txPattern, (uint16_t)sizeof(txPattern), 100U) == HAL_OK)
  {
    txOk = 1U;
  }

  start = HAL_GetTick();
  while ((HAL_GetTick() - start) < 250U)
  {
    if (HAL_UART_Receive(&huart7, &rxByte, 1U, 5U) == HAL_OK)
    {
      if (rxCount < (uint32_t)sizeof(rxCapture))
      {
        rxCapture[rxCount] = rxByte;
      }
      rxCount++;
      if ((rxCount >= (uint32_t)sizeof(txPattern)) &&
          (memcmp(rxCapture, txPattern, sizeof(txPattern)) == 0))
      {
        pass = 1U;
        break;
      }
    }
  }

  (void)snprintf(msg,
                 sizeof(msg),
                 "[WIFI] UART7 loopback tx_ok=%lu rx=%lu first=%02X %02X %02X %02X pass=%lu\\r\\n",
                 (unsigned long)txOk,
                 (unsigned long)rxCount,
                 (unsigned int)rxCapture[0],
                 (unsigned int)rxCapture[1],
                 (unsigned int)rxCapture[2],
                 (unsigned int)rxCapture[3],
                 (unsigned long)pass);
  UART4_SendText(msg);
#endif
}

static void WIFI_UART7_QuickAtProbe(void)
{
  static const uint8_t atCmd[] = {'A', 'T', '\r', '\n'};
  uint8_t rxBuf[10] = {0};
  uint8_t rxByte = 0U;
  uint32_t probeOk = 0U;
  char msg[200];

  UART4_SendText("[WIFI] Switching to UART7 for MB1400...\r\n");

  /* Pulse CHIP_EN to wake module before first probe. */
  HAL_GPIO_WritePin(MB1400_CHIP_EN_GPIO_Port, MB1400_CHIP_EN_Pin, GPIO_PIN_RESET);
  osDelay(100);
  HAL_GPIO_WritePin(MB1400_CHIP_EN_GPIO_Port, MB1400_CHIP_EN_Pin, GPIO_PIN_SET);
  osDelay(500);

  for (uint32_t rtsMode = 0U; rtsMode < 2U; rtsMode++)
  {
    uint32_t txOk = 0U;
    uint32_t rxOk = 0U;
    GPIO_PinState rtsPin = (rtsMode == 0U) ? GPIO_PIN_RESET : GPIO_PIN_SET;

    HAL_GPIO_WritePin(MB1400_RTS_GPIO_Port, MB1400_RTS_Pin, rtsPin);
    osDelay(20);

    /* Drain stale UART7 bytes. */
    for (uint32_t i = 0U; i < 32U; i++)
    {
      if (HAL_UART_Receive(&huart7, &rxByte, 1U, 2U) != HAL_OK)
      {
        break;
      }
    }

    memset(rxBuf, 0, sizeof(rxBuf));
    if (HAL_UART_Transmit(&huart7, (uint8_t*)atCmd, (uint16_t)sizeof(atCmd), 100U) == HAL_OK)
    {
      txOk = 1U;
    }

    if (HAL_UART_Receive(&huart7, rxBuf, (uint16_t)sizeof(rxBuf), 500U) == HAL_OK)
    {
      rxOk = 1U;
      probeOk = 1U;
    }

    (void)snprintf(msg,
                   sizeof(msg),
                   "[WIFI] UART7 probe rts=%lu tx_ok=%lu rx_ok=%lu first=%02X %02X %02X %02X\r\n",
                   (unsigned long)rtsMode,
                   (unsigned long)txOk,
                   (unsigned long)rxOk,
                   (unsigned int)rxBuf[0],
                   (unsigned int)rxBuf[1],
                   (unsigned int)rxBuf[2],
                   (unsigned int)rxBuf[3]);
    UART4_SendText(msg);

    if (rxOk != 0U)
    {
      /* Keep working RTS level for subsequent AT init. */
      break;
    }
  }

  if (probeOk == 0U)
  {
    UART4_SendText("[WIFI] Still no response on UART7. Check PE7/PE8 AF config and SB1/SB5/SB7.\r\n");
  }
}

#if WIFI_SPI4_LOOPBACK_TEST
static uint32_t g_spi4_last_sr_before = 0U;
static uint32_t g_spi4_last_sr_after = 0U;
static uint32_t g_spi4_last_stage = 0U;

static void WIFI_SPI4_GpioShortSelfTest(void)
{
#if WIFI_SPI4_LOOPBACK_TEST
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  uint32_t pdHigh = 0U;
  uint32_t puLow = 0U;
  uint32_t pass = 0U;
  char msg[160];

  __HAL_RCC_GPIOE_CLK_ENABLE();

  /* STMod+ SPI route on STM32H7S78-DK: PE14 (MOSI), PE13 (MISO). */
  GPIO_InitStruct.Pin = GPIO_PIN_14;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

  GPIO_InitStruct.Pin = GPIO_PIN_13;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_14, GPIO_PIN_SET);
  HAL_Delay(1U);
  if (HAL_GPIO_ReadPin(GPIOE, GPIO_PIN_13) == GPIO_PIN_SET)
  {
    pdHigh = 1U;
  }

  GPIO_InitStruct.Pin = GPIO_PIN_13;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_14, GPIO_PIN_RESET);
  HAL_Delay(1U);
  if (HAL_GPIO_ReadPin(GPIOE, GPIO_PIN_13) == GPIO_PIN_RESET)
  {
    puLow = 1U;
  }

  pass = ((pdHigh != 0U) && (puLow != 0U)) ? 1U : 0U;

  (void)snprintf(msg,
                 sizeof(msg),
                 "[WIFI] SPI4 gpio-short pe14->pe13 pd_high=%lu pu_low=%lu pass=%lu\\r\\n",
                 (unsigned long)pdHigh,
                 (unsigned long)puLow,
                 (unsigned long)pass);
  UART4_SendText(msg);
#endif
}

static void WIFI_SPI4_ClearFlags(void)
{
#if WIFI_SPI4_LOOPBACK_TEST
  SPI4->IFCR = (SPI_IFCR_EOTC | SPI_IFCR_TXTFC | SPI_IFCR_OVRC | SPI_IFCR_UDRC | SPI_IFCR_MODFC | SPI_IFCR_SUSPC);
#endif
}

static void WIFI_SPI4_InitForLoopback(uint32_t gpioAlternate, uint32_t cfg2ExtraBits)
{
#if WIFI_SPI4_LOOPBACK_TEST
  GPIO_InitTypeDef GPIO_InitStruct = {0};

  __HAL_RCC_GPIOE_CLK_ENABLE();
  __HAL_RCC_SPI4_CLK_ENABLE();

  /* SPI4 on PE12(SCK), PE13(MISO), PE14(MOSI), PE10(CS) for STMod+ SPI mode. */
  GPIO_InitStruct.Pin = GPIO_PIN_10 | GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_14;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = (uint32_t)gpioAlternate;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

