stardio/STM32_Ethercat_AGV/Appli/Core/Src/main.c
  __HAL_RCC_SPI4_FORCE_RESET();
  __HAL_RCC_SPI4_RELEASE_RESET();

  SPI4->CR1 = 0U;
  SPI4->CR2 = 0U;
  SPI4->IFCR = 0xFFFFFFFFUL;

  /* 8-bit data, conservative baud divider for first bring-up. */
  SPI4->CFG1 = ((7UL << SPI_CFG1_DSIZE_Pos) | SPI_CFG1_MBR_1 | SPI_CFG1_MBR_0);
  SPI4->CFG2 = (SPI_CFG2_MASTER | SPI_CFG2_SSM | cfg2ExtraBits);
  SPI4->CR1 = SPI_CR1_SSI;
  SET_BIT(SPI4->CR1, SPI_CR1_SPE);

  g_spi4_last_sr_before = SPI4->SR;
  if ((SPI4->SR & SPI_SR_MODF) != 0U)
  {
    WIFI_SPI4_ClearFlags();
  }
#endif
}

static uint8_t WIFI_SPI4_TransferByte(uint8_t txByte, uint8_t *rxByte, uint32_t timeoutMs)
{
#if WIFI_SPI4_LOOPBACK_TEST
  uint32_t tickStart;

  g_spi4_last_stage = 0U;
  g_spi4_last_sr_before = SPI4->SR;

  if (rxByte == NULL)
  {
    g_spi4_last_stage = 7U;
    g_spi4_last_sr_after = SPI4->SR;
    return 0U;
  }

  WIFI_SPI4_ClearFlags();

  MODIFY_REG(SPI4->CR2, SPI_CR2_TSIZE, 1UL);
  SET_BIT(SPI4->CR1, SPI_CR1_CSTART);

  tickStart = HAL_GetTick();
  while ((SPI4->SR & SPI_SR_TXP) == 0U)
  {
    if ((SPI4->SR & SPI_SR_MODF) != 0U)
    {
      g_spi4_last_stage = 4U;
      g_spi4_last_sr_after = SPI4->SR;
      WIFI_SPI4_ClearFlags();
      return 0U;
    }
    if ((HAL_GetTick() - tickStart) >= timeoutMs)
    {
      g_spi4_last_stage = 1U;
      g_spi4_last_sr_after = SPI4->SR;
      return 0U;
    }
  }
  *(__IO uint8_t*)&SPI4->TXDR = txByte;

  tickStart = HAL_GetTick();
  while ((SPI4->SR & SPI_SR_RXP) == 0U)
  {
    if ((SPI4->SR & SPI_SR_MODF) != 0U)
    {
      g_spi4_last_stage = 5U;
      g_spi4_last_sr_after = SPI4->SR;
      WIFI_SPI4_ClearFlags();
      return 0U;
    }
    if ((HAL_GetTick() - tickStart) >= timeoutMs)
    {
      g_spi4_last_stage = 2U;
      g_spi4_last_sr_after = SPI4->SR;
      return 0U;
    }
  }
  *rxByte = *(__IO uint8_t*)&SPI4->RXDR;

  tickStart = HAL_GetTick();
  while ((SPI4->SR & SPI_SR_EOT) == 0U)
  {
    if ((SPI4->SR & SPI_SR_MODF) != 0U)
    {
      g_spi4_last_stage = 6U;
      g_spi4_last_sr_after = SPI4->SR;
      WIFI_SPI4_ClearFlags();
      return 0U;
    }
    if ((HAL_GetTick() - tickStart) >= timeoutMs)
    {
      g_spi4_last_stage = 3U;
      g_spi4_last_sr_after = SPI4->SR;
      return 0U;
    }
  }

  g_spi4_last_stage = 100U;
  g_spi4_last_sr_after = SPI4->SR;
  WIFI_SPI4_ClearFlags();
  return 1U;
#else
  (void)txByte;
  (void)rxByte;
  (void)timeoutMs;
  return 0U;
#endif
}

static void WIFI_SPI4_LoopbackSelfTest(void)
{
#if WIFI_SPI4_LOOPBACK_TEST
  typedef struct
  {
    uint32_t gpioAlternate;
    uint32_t cfg2ExtraBits;
    const char* name;
  } WIFI_SPI4_TestCase;

  static const WIFI_SPI4_TestCase testCases[] = {
    {GPIO_AF5_SPI4, 0U, "af5"},
    {GPIO_AF6_SPI4, 0U, "af6"},
    {GPIO_AF5_SPI4, SPI_CFG2_IOSWP, "af5+ioswp"},
    {GPIO_AF6_SPI4, SPI_CFG2_IOSWP, "af6+ioswp"},
    {GPIO_AF5_SPI4, SPI_CFG2_AFCNTR, "af5+afcntr"},
    {GPIO_AF6_SPI4, SPI_CFG2_AFCNTR, "af6+afcntr"},
    {GPIO_AF5_SPI4, SPI_CFG2_SSOE, "af5+ssoe"},
    {GPIO_AF6_SPI4, SPI_CFG2_SSOE, "af6+ssoe"},
    {GPIO_AF5_SPI4, (SPI_CFG2_IOSWP | SPI_CFG2_AFCNTR), "af5+ioswp+afcntr"},
    {GPIO_AF6_SPI4, (SPI_CFG2_IOSWP | SPI_CFG2_AFCNTR), "af6+ioswp+afcntr"},
    {GPIO_AF5_SPI4, (SPI_CFG2_IOSWP | SPI_CFG2_SSOE), "af5+ioswp+ssoe"},
    {GPIO_AF6_SPI4, (SPI_CFG2_IOSWP | SPI_CFG2_SSOE), "af6+ioswp+ssoe"}
  };
  static const uint8_t txPattern[] = {0xA5U, 0x5AU, 0x3CU, 0xC3U};
  uint8_t rxPattern[sizeof(txPattern)] = {0};
  uint32_t selectedCase = 0xFFFFFFFFUL;
  char msg[240];

  WIFI_SPI4_GpioShortSelfTest();

  for (uint32_t caseIndex = 0U; caseIndex < (uint32_t)(sizeof(testCases) / sizeof(testCases[0])); caseIndex++)
  {
    uint32_t txCount = 0U;
    uint32_t rxMatch = 0U;
    uint32_t pass = 1U;
    uint32_t sr = 0U;

    memset(rxPattern, 0, sizeof(rxPattern));
    WIFI_SPI4_InitForLoopback(testCases[caseIndex].gpioAlternate, testCases[caseIndex].cfg2ExtraBits);

    for (uint32_t i = 0U; i < (uint32_t)sizeof(txPattern); i++)
    {
      uint8_t rxByte = 0U;
      if (WIFI_SPI4_TransferByte(txPattern[i], &rxByte, 20U) == 0U)
      {
        pass = 0U;
        break;
      }

      txCount++;
      rxPattern[i] = rxByte;
      if (rxByte == txPattern[i])
      {
        rxMatch++;
      }
      else
      {
        pass = 0U;
      }
    }

    sr = SPI4->SR;
    CLEAR_BIT(SPI4->CR1, SPI_CR1_SPE);

    (void)snprintf(msg,
                   sizeof(msg),
                   "[WIFI] SPI4 probe=%s tx=%lu match=%lu stage=%lu sr0=%08lX sr1=%08lX sr=%08lX rx=%02X %02X %02X %02X pass=%lu\\r\\n",
                   testCases[caseIndex].name,
                   (unsigned long)txCount,
                   (unsigned long)rxMatch,
                   (unsigned long)g_spi4_last_stage,
                   (unsigned long)g_spi4_last_sr_before,
                   (unsigned long)g_spi4_last_sr_after,
                   (unsigned long)sr,
                   (unsigned int)rxPattern[0],
                   (unsigned int)rxPattern[1],
                   (unsigned int)rxPattern[2],
                   (unsigned int)rxPattern[3],
                   (unsigned long)pass);
    UART4_SendText(msg);

    if (pass != 0U)
    {
      selectedCase = caseIndex;
      break;
    }
  }

  if (selectedCase != 0xFFFFFFFFUL)
  {
    (void)snprintf(msg,
                   sizeof(msg),
                   "[WIFI] SPI4 loopback route=%s selected\\r\\n",
                   testCases[selectedCase].name);
    UART4_SendText(msg);
  }
  else
  {
    UART4_SendText("[WIFI] SPI4 loopback no valid route found\\r\\n");
  }
#endif
}
#endif

/* Called by HAL when DMA TX completes */
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
  if (huart->Instance == UART4)
  {
    uart_dma_busy = 0;
  }
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
  if (huart->Instance == UART4)
  {
    uint16_t nextHead = (uint16_t)((g_pcUartRxHead + 1U) % PC_UART_RX_RING_SIZE);
    if (nextHead != g_pcUartRxTail)
    {
      g_pcUartRxRing[g_pcUartRxHead] = g_pcUartRxByte;
      g_pcUartRxHead = nextHead;
    }

