stardio/STM32_Ethercat_AGV/Appli/Core/Src/main.c
/* LAN8742 PHY IO functions */
static int32_t ETH_PHY_IO_Init(void)
{
  HAL_ETH_SetMDIOClockRange(&heth);
  return 0;
}

static int32_t ETH_PHY_IO_DeInit(void)
{
  return 0;
}

static int32_t ETH_PHY_IO_ReadReg(uint32_t dev_addr, uint32_t reg_addr, uint32_t *p_reg_val)
{
  if (HAL_ETH_ReadPHYRegister(&heth, dev_addr, reg_addr, p_reg_val) != HAL_OK)
  {
    return -1;
  }
  return 0;
}

static int32_t ETH_PHY_IO_WriteReg(uint32_t dev_addr, uint32_t reg_addr, uint32_t reg_val)
{
  if (HAL_ETH_WritePHYRegister(&heth, dev_addr, reg_addr, reg_val) != HAL_OK)
  {
    return -1;
  }
  return 0;
}

static int32_t ETH_PHY_IO_GetTick(void)
{
  return (int32_t)HAL_GetTick();
}

static lan8742_Object_t lan8742;
static lan8742_IOCtx_t lan8742_io_ctx = {
  ETH_PHY_IO_Init,
  ETH_PHY_IO_DeInit,
  ETH_PHY_IO_WriteReg,
  ETH_PHY_IO_ReadReg,
  ETH_PHY_IO_GetTick
};

/**
  * @brief ETH Initialization Function
  * @param None
  * @retval None
  */
static void MX_ETH_Init(void)
{
  static uint8_t MACAddr[6] = {0x00, 0x80, 0xE1, 0x00, 0x00, 0x01};

  heth.Instance = ETH;
  heth.Init.MACAddr = MACAddr;
  heth.Init.MediaInterface = HAL_ETH_RMII_MODE;
  heth.Init.TxDesc = DMATxDscrTab;
  heth.Init.RxDesc = DMARxDscrTab;
  heth.Init.RxBuffLen = 1536;

  g_soemErrorCode = 100;  /* Starting ETH init (10%) */

  /* Note: Clock configuration is done in HAL_ETH_MspInit (stm32h7rsxx_hal_msp.c) */
  
  HAL_StatusTypeDef status = HAL_ETH_Init(&heth);
  g_soemErrorCode = 120;  /* HAL_ETH_Init returned (12%) */
  
  if (status != HAL_OK)
  {
    g_ethLinkStatus = 0;
    g_soemErrorCode = 130 + status;  /* 131=Error, 132=Busy, 133=Timeout (13%) */
    return;
  }

  /* Enable promiscuous mode for EtherCAT */
  ETH_MACFilterConfigTypeDef filterConfig;
  HAL_ETH_GetMACFilterConfig(&heth, &filterConfig);
  filterConfig.PromiscuousMode = ENABLE;
  filterConfig.ReceiveAllMode = ENABLE;
  filterConfig.PassAllMulticast = ENABLE;
  HAL_ETH_SetMACFilterConfig(&heth, &filterConfig);
  
  g_soemErrorCode = 150;  /* ETH Init OK, starting PHY (15%) */

  /* Force MAC out of loopback if any previous config touched it */
  ETH_MACConfigTypeDef macConf;
  if (HAL_ETH_GetMACConfig(&heth, &macConf) == HAL_OK)
  {
    macConf.LoopbackMode = DISABLE;
    (void)HAL_ETH_SetMACConfig(&heth, &macConf);
  }

  /* Initialize LAN8742 PHY */
  LAN8742_RegisterBusIO(&lan8742, &lan8742_io_ctx);

  /* Probe PHY address (0..31) from BSR before LAN8742_Init */
  uint8_t phyAddrFound = 0xFF;
  for (uint32_t addr = 0; addr < 32U; addr++)
  {
    uint32_t bsr = 0U;
    if ((HAL_ETH_ReadPHYRegister(&heth, addr, LAN8742_BSR, &bsr) == HAL_OK) &&
        (bsr != 0x0000U) && (bsr != 0xFFFFU))
    {
      phyAddrFound = (uint8_t)addr;
      break;
    }
  }

  if (phyAddrFound != 0xFFU)
  {
    lan8742.DevAddr = phyAddrFound;
    g_soemErrorCode = 160 + phyAddrFound;  /* PHY addr found: 160..191 */
  }
  else
  {
    lan8742.DevAddr = 0U;
    g_soemErrorCode = 159;  /* PHY addr scan failed, fallback to 0 */
  }

  int32_t phyStatus = LAN8742_Init(&lan8742);
  if (phyStatus != LAN8742_STATUS_OK)
  {
    g_ethLinkStatus = 0;
    g_soemErrorCode = 190 + (-phyStatus);  /* PHY Init failed (19%) */
    return;
  }

  g_soemErrorCode = 200;  /* PHY Init OK, starting ETH (20%) */
  
  /* Start ETH - polling mode for SOEM */
  status = HAL_ETH_Start(&heth);
  if (status == HAL_OK)
  {
    int32_t linkState = LAN8742_GetLinkState(&lan8742);
    g_ethLinkStatus = (linkState > LAN8742_STATUS_LINK_DOWN) ? 1 : 0;
    g_soemErrorCode = (g_ethLinkStatus == 1) ? 300 : 301;  /* 300=link up, 301=ETH started but link down */
  }
  else
  {
    g_ethLinkStatus = 0;
    g_soemErrorCode = 250 + status;  /* HAL_ETH_Start failed (25%) */
  }
}

/* SOEM context and buffers */
static char IOmap[4096];
static ecx_contextt ecatContext;

/**
  * @brief  EtherCAT Task - handles SOEM initialization and cyclic processing
  * @param  argument: Not used
  * @retval None
  */
void EtherCAT_Task(void *argument)
{
  (void)argument;

  /* User LED defines: LD1 (Green) = PO1, LD2 (Orange) = PO5 */
  #define LD1_PORT GPIOO
  #define LD1_PIN  GPIO_PIN_1
  #define LD2_PORT GPIOO
  #define LD2_PIN  GPIO_PIN_5

  /* Wait for system to stabilize */
  osDelay(500);
  
  /* LED blink to indicate task started - LD1 (Green) */
  for (int i = 0; i < 3; i++)
  {
    HAL_GPIO_WritePin(LD1_PORT, LD1_PIN, GPIO_PIN_SET);
    osDelay(100);
    HAL_GPIO_WritePin(LD1_PORT, LD1_PIN, GPIO_PIN_RESET);
    osDelay(100);
  }

  UART4_SendText("[ETH] task start\r\n");

  /* Initialize ETH in this task to avoid blocking main() */
  MX_ETH_Init();

  /* Wait for PHY link up (auto-negotiation can take a few seconds) */
  int32_t linkStatePhy = LAN8742_STATUS_LINK_DOWN;
  for (int i = 0; i < 60; i++) /* up to ~6 seconds */
  {
    linkStatePhy = LAN8742_GetLinkState(&lan8742);
    if (linkStatePhy > LAN8742_STATUS_LINK_DOWN)
    {
      break;
    }

    g_soemErrorCode = 240 + (i % 10);  /* 240-249: waiting link */
    HAL_GPIO_TogglePin(LD2_PORT, LD2_PIN);
    osDelay(100);
  }

  if (linkStatePhy <= LAN8742_STATUS_LINK_DOWN)
  {
    g_soemErrorCode = 239;  /* link timeout */
    while (1)
    {
      HAL_GPIO_TogglePin(LD2_PORT, LD2_PIN);
      osDelay(200);
    }
  }

  g_ethLinkStatus = 1;
  g_soemErrorCode = 280;  /* link up, entering continuous TX test */

#ifndef SOEM_ENABLED
  /* === ETH-ONLY CONTINUOUS TX TEST === */
  {
    /* Simple test packet in RAM_CMD (MPU non-cacheable) for DMA */
    static uint8_t testPkt[64] __attribute__((section(".eth_dma"), aligned(32)));
    memset(testPkt, 0xAA, 64);
    /* Broadcast destination MAC */
    testPkt[0] = 0xFF; testPkt[1] = 0xFF; testPkt[2] = 0xFF;
    testPkt[3] = 0xFF; testPkt[4] = 0xFF; testPkt[5] = 0xFF;
    /* Source MAC */
    testPkt[6] = 0x02; testPkt[7] = 0x00; testPkt[8] = 0x00;
    testPkt[9] = 0x00; testPkt[10] = 0x00; testPkt[11] = 0x01;
    /* EtherType: EtherCAT (0x88A4) */
    testPkt[12] = 0x88; testPkt[13] = 0xA4;

    ETH_BufferTypeDef txBuf;
    ETH_TxPacketConfigTypeDef txCfg;
    txBuf.buffer = testPkt;
    txBuf.len = 64;
    txBuf.next = NULL;
    txCfg.Length = 64;
    txCfg.TxBuffer = &txBuf;
    txCfg.Attributes = ETH_TX_PACKETS_FEATURES_CRCPAD;
    txCfg.ChecksumCtrl = ETH_CHECKSUM_DISABLE;
    txCfg.CRCPadCtrl = ETH_CRC_PAD_INSERT;
    txCfg.SrcAddrCtrl = ETH_SRC_ADDR_CONTROL_DISABLE;

    /* Clean up any partially-configured TX descriptors before loop */
    for (uint32_t i = 0; i < ETH_TX_DESC_CNT; i++)
    {
      (void)HAL_ETH_ReleaseTxPacket(&heth);
    }
    
