stardio/STM32_Ethercat_AGV/Appli/Core/Src/main.c
    /* Force reset of TX descriptor ring to start from desc[0] */
    heth.TxDescList.CurTxDesc = 0;
    heth.TxDescList.BuffersInUse = 0;
    heth.TxDescList.releaseIndex = 0;

    while (1)
    {
      static uint32_t tbuStreak = 0U;
      static uint32_t ethRestartCount = 0U;
      static uint32_t lastCode = 0U;
      static uint32_t uartMsgCount = 0U;

      /* Release any completed TX descriptors before transmitting */
      (void)HAL_ETH_ReleaseTxPacket(&heth);
      
      /* Check descriptor availability before transmit */
      if (heth.TxDescList.BuffersInUse >= ETH_TX_DESC_CNT)
      {
        /* All descriptors in use - force release */
        for (uint32_t i = 0; i < ETH_TX_DESC_CNT; i++)
        {
          (void)HAL_ETH_ReleaseTxPacket(&heth);
        }
      }
      
      HAL_StatusTypeDef txResult = HAL_ETH_Transmit(&heth, &txCfg, 500);
      uint32_t dmacsr = ETH->DMACSR;
      uint32_t txIrq = dmacsr & ETH_DMACSR_TI;
      uint32_t txBufUnavailable = dmacsr & ETH_DMACSR_TBU;
      uint32_t txProcStopped = dmacsr & ETH_DMACSR_TPS;
      uint32_t txEarlyIrq = dmacsr & ETH_DMACSR_ETI;
      uint32_t txFatalBusErr = dmacsr & ETH_DMACSR_FBE;
      uint32_t txErrBits = dmacsr & ETH_DMACSR_TEB;
      uint32_t maccr = ETH->MACCR;
      uint32_t dmactcr = ETH->DMACTCR;
      uint32_t dmacier = ETH->DMACIER;
      uint32_t dmactdlar = ETH->DMACTDLAR;
      uint32_t dmactdtpr = ETH->DMACTDTPR;
      uint32_t dmactdrlr = ETH->DMACTDRLR;
      uint32_t dmaccatdr = ETH->DMACCATDR;
      uint32_t curTxDesc = heth.TxDescList.CurTxDesc;
      uint32_t txInUse = heth.TxDescList.BuffersInUse;
      uint32_t txReleaseIdx = heth.TxDescList.releaseIndex;
      char line[512];

      if (txResult == HAL_OK)
      {
        (void)HAL_ETH_ReleaseTxPacket(&heth);
        g_soem_eth_state = heth.gState;

        /* Fatal or stopped TX path */
        if ((txFatalBusErr != 0U) || (txProcStopped != 0U) || (txErrBits != 0U))
        {
          g_soemErrorCode = 262;  /* DMA error while TX */
          g_soem_eth_error = dmacsr;
          HAL_GPIO_TogglePin(LD2_PORT, LD2_PIN);
        }
        else if (txBufUnavailable != 0U)
        {
          g_soemErrorCode = 263;  /* TX descriptor/buffer unavailable */
          g_soem_eth_error = dmacsr;
          HAL_GPIO_TogglePin(LD2_PORT, LD2_PIN);
        }
        else if (txIrq != 0U)
        {
          g_soemErrorCode = 281;  /* TX interrupt observed */
          HAL_GPIO_TogglePin(LD1_PORT, LD1_PIN);
        }
        else if (txEarlyIrq != 0U)
        {
          g_soemErrorCode = 283;  /* Early TX interrupt only */
          HAL_GPIO_TogglePin(LD1_PORT, LD1_PIN);
        }
        else
        {
          g_soemErrorCode = 282;  /* HAL OK but no DMA TX interrupt */
          HAL_GPIO_TogglePin(LD2_PORT, LD2_PIN);
        }
      }
      else
      {
        g_soemErrorCode = 261;  /* TX fail */
        g_soem_eth_error = heth.ErrorCode;
        g_soem_eth_state = heth.gState;
        HAL_GPIO_TogglePin(LD2_PORT, LD2_PIN);
      }

      if ((txBufUnavailable != 0U) && (txIrq == 0U))
      {
        tbuStreak++;
      }
      else
      {
        tbuStreak = 0U;
      }

      /* Recover from persistent TBU lock: restart MAC/DMA channel. */
      if (tbuStreak >= 20U)
      {
        (void)HAL_ETH_Stop(&heth);
        (void)HAL_ETH_Start(&heth);
        ethRestartCount++;
        tbuStreak = 0U;
        g_soemErrorCode = 264;
      }

      /* DMACSR bits are sticky W1C, clear bits we inspect each cycle. */
      ETH->DMACSR = (ETH_DMACSR_TI | ETH_DMACSR_TBU | ETH_DMACSR_ETI |
                     ETH_DMACSR_TPS | ETH_DMACSR_FBE | ETH_DMACSR_AIS |
                     ETH_DMACSR_NIS);

      /* Send UART diagnostic only once at startup */
      if (uartMsgCount == 0U)
      {
        uint32_t txd0 = DMATxDscrTab[0].DESC3;
        uint32_t txd1 = DMATxDscrTab[1].DESC3;
        uint32_t txd2 = DMATxDscrTab[2].DESC3;
        uint32_t txd3 = DMATxDscrTab[3].DESC3;
        
        int len = snprintf(line, sizeof(line),
                           "code   : %lu\r\n"
                           "dmacsr : 0x%08lX\r\n"
                           "flags  : TI=%lu TBU=%lu ETI=%lu TPS=%lu FBE=%lu TEB=0x%lX\r\n"
                           "regs   : MACCR=0x%08lX DMACTCR=0x%08lX DMACIER=0x%08lX\r\n"
                           "txreg  : TDLAR=0x%08lX TDTPR=0x%08lX TDRLR=0x%08lX CATDR=0x%08lX\r\n"
                           "ring   : cur=%lu inuse=%lu rel=%lu rst=%lu streak=%lu\r\n"
                           "desc3  : D0=0x%08lX D1=0x%08lX D2=0x%08lX D3=0x%08lX\r\n"
                           "\r\n",
                           (unsigned long)g_soemErrorCode,
                           (unsigned long)dmacsr,
                           (unsigned long)((txIrq != 0U) ? 1U : 0U),
                           (unsigned long)((txBufUnavailable != 0U) ? 1U : 0U),
                           (unsigned long)((txEarlyIrq != 0U) ? 1U : 0U),
                           (unsigned long)((txProcStopped != 0U) ? 1U : 0U),
                           (unsigned long)((txFatalBusErr != 0U) ? 1U : 0U),
                           (unsigned long)(txErrBits >> ETH_DMACSR_TEB_Pos),
                           (unsigned long)maccr,
                           (unsigned long)dmactcr,
                           (unsigned long)dmacier,
                           (unsigned long)dmactdlar,
                           (unsigned long)dmactdtpr,
                           (unsigned long)dmactdrlr,
                           (unsigned long)dmaccatdr,
                           (unsigned long)curTxDesc,
                           (unsigned long)txInUse,
                           (unsigned long)txReleaseIdx,
                           (unsigned long)ethRestartCount,
                           (unsigned long)tbuStreak,
                           (unsigned long)txd0,
                           (unsigned long)txd1,
                           (unsigned long)txd2,
                           (unsigned long)txd3);
        if (len > 0)
        {
          (void)HAL_UART_Transmit(&huart4, (uint8_t *)line, (uint16_t)len, 100);
        }
        uartMsgCount = 1U;  /* Prevent future output */
      }

      osDelay(100);
    }
  }
  /* === END ETH-ONLY TEST === */
#else
  /* === SOEM ETHERCAT MASTER === */
  /* Initialize DWT cycle counter for µs-resolution OSAL timing */
  extern void osal_dwt_init(void);
  osal_dwt_init();

  UART4_SendText("\r\n[SOEM] Initializing EtherCAT master...\r\n");
  
  /* Set up SOEM logging to UART */
  SOEM_PortSetLog(UART4_SendText);
  
  /* Initialize SOEM */
  SOEM_PortInit();
  Pc_CommandInit();
  
  UART4_SendText("[SOEM] Starting cyclic processing\r\n");
  g_soemErrorCode = 310;  /* SOEM running */

  /* Precise 1ms cycle using vTaskDelayUntil */
  TickType_t xLastWakeTime = xTaskGetTickCount();
  const TickType_t xPeriod = pdMS_TO_TICKS(1);  /* 1ms */

  /* DWT-based cycle time measurement */
  volatile uint32_t *DWT_CYCCNT_PTR  = (volatile uint32_t *)0xE0001004U;
  const uint32_t cpu_freq = SystemCoreClock;  /* 600 MHz */
  uint32_t cyc_prev = *DWT_CYCCNT_PTR;
  uint32_t cyc_min  = 0xFFFFFFFFU;
  uint32_t cyc_max  = 0U;
  uint64_t cyc_sum  = 0U;
  uint32_t cyc_cnt  = 0U;
  uint32_t cyc_poll_max = 0U;  /* max SOEM_PortPoll() time */
  uint32_t tel_tick = 0U;       /* telemetry decimation counter (1 tick = 1ms cycle) */

  /* Main EtherCAT cycle */
  while (1)
  {
    /* Handle PC-side command lines from UART4 (LCD clone control). */
    Pc_CommandPollUart();

    /* Measure SOEM_PortPoll execution time */
    uint32_t poll_start = *DWT_CYCCNT_PTR;

