stardio/STM32_Ethercat_AGV/Appli/Core/Src/main.c
    /* Poll SOEM state machine */
    SOEM_PortPoll();
    Pc_CommandTick();

    /* Stream compact telemetry for PC GUI every 50ms. */
    if ((tel_tick++ % 50U) == 0U)
    {
      const int32_t pos = SOEM_GetPositionActual();
      const int32_t vel = SOEM_GetVelocityActual();
      const int16_t tq = SOEM_GetTorqueActual();
      const uint16_t sw = SOEM_GetStatusword();
      const uint8_t pdo = SOEM_GetPdoReady();
      const uint8_t run = SOEM_GetRunEnable();
      char tel[160];

      (void)snprintf(tel,
                     sizeof(tel),
                     "TEL,pos=%ld,vel=%ld,torque=%d,status=0x%04X,pdo=%u,run=%u\r\n",
                     (long)pos,
                     (long)vel,
                     (int)tq,
                     (unsigned int)sw,
                     (unsigned int)pdo,
                     (unsigned int)run);
      UART4_SendText(tel);
    }

    uint32_t poll_elapsed = *DWT_CYCCNT_PTR - poll_start;
    if (poll_elapsed > cyc_poll_max) cyc_poll_max = poll_elapsed;
    
    /* Monitor slave state changes */
    #ifdef SOEM_ENABLED
    static uint8_t last_slave_state[EC_MAXSLAVE] = {0};
    for (int i = 1; i <= soem_context.slavecount; i++)
    {
      uint8_t current_state = (uint8_t)soem_context.slavelist[i].state;
      if (current_state != last_slave_state[i])
      {
        last_slave_state[i] = current_state;
        char msg[128];
        snprintf(msg, sizeof(msg), "[SOEM] Slave %d: State=%d AL=0x%04X\r\n", 
                 i, current_state, soem_context.slavelist[i].ALstatuscode);
        UART4_SendText(msg);
        
        if (current_state == 8)  /* EC_STATE_OPERATIONAL */
        {
          UART4_SendText("[SOEM] Slave reached OPERATIONAL state\r\n");
          HAL_GPIO_WritePin(LD1_PORT, LD1_PIN, GPIO_PIN_SET);
        }
      }
    }
    
    g_slaveCount = (uint8_t)soem_context.slavecount;
    #endif
    
    /* Flush UART ring buffer (non-blocking via IT) */
    UART_LogFlush();

    /* Measure cycle time before sleep */
    uint32_t cyc_now = *DWT_CYCCNT_PTR;
    uint32_t cyc_delta = cyc_now - cyc_prev;
    cyc_prev = cyc_now;

    if (cyc_cnt > 0)  /* skip first cycle (invalid delta) */
    {
      if (cyc_delta < cyc_min) cyc_min = cyc_delta;
      if (cyc_delta > cyc_max) cyc_max = cyc_delta;
      cyc_sum += cyc_delta;
    }
    cyc_cnt++;

    /* Print timing stats every 5 seconds (5000 cycles @ 1ms) */
    if (cyc_cnt > 0 && (cyc_cnt % 5000U) == 0U)
    {
      uint32_t avg_us  = (uint32_t)(cyc_sum / (cyc_cnt - 1U) / (cpu_freq / 1000000U));
      uint32_t min_us  = cyc_min / (cpu_freq / 1000000U);
      uint32_t max_us  = cyc_max / (cpu_freq / 1000000U);
      uint32_t poll_us = cyc_poll_max / (cpu_freq / 1000000U);
      int32_t  jitter  = (int32_t)(max_us - min_us);
      char tbuf[180];
      snprintf(tbuf, sizeof(tbuf),
               "[TIMING] cycles=%lu  avg=%lu us  min=%lu us  max=%lu us  "
               "jitter=%ld us  poll_max=%lu us\r\n",
               (unsigned long)cyc_cnt,
               (unsigned long)avg_us, (unsigned long)min_us,
               (unsigned long)max_us, (long)jitter,
               (unsigned long)poll_us);
      UART4_SendText(tbuf);
      /* Reset stats for next window */
      cyc_min = 0xFFFFFFFFU;
      cyc_max = 0U;
      cyc_sum = 0U;
      cyc_cnt = 1U;
      cyc_poll_max = 0U;
    }

    HAL_GPIO_TogglePin(LD1_PORT, LD1_PIN);
    vTaskDelayUntil(&xLastWakeTime, xPeriod);  /* Precise 1ms period */
  }
#endif

  /* Note: The code below this point is unreachable due to infinite loops above */

  /* Initialize SOEM context to zero */
  memset(&ecatContext, 0, sizeof(ecatContext));

  g_soemErrorCode = 310;  /* Starting ecx_init (31%) */

  /* Initialize SOEM - interface name for STM32 */
  if (ecx_init(&ecatContext, "st_eth") <= 0)
  {
    g_soemInitStatus = 2;  /* Error - SOEM init failed */
    g_soemErrorCode = 320;  /* ecx_init failed (32%) */
    uint32_t cnt = 0;
    for(;;)
    {
      g_soemErrorCode = 321 + (cnt % 9);  /* 321-329 = ecx_init fail loop */
      cnt++;
      osDelay(1000);
    }
  }

  g_soemErrorCode = 350;  /* ecx_init OK, starting config_init (35%) */

  /* DEBUG: Check sockhandle right after ecx_init */
  g_soem_sockhandle_value = ecatContext.port.sockhandle;
  if (ecatContext.port.sockhandle <= 0)
  {
    g_soemErrorCode = 355;  /* sockhandle invalid after ecx_init! */
    for(;;)
    {
      g_soemErrorCode = 355;
      osDelay(1000);
    }
  }
  g_soemErrorCode = 356;  /* sockhandle OK */

  /* Check PHY link status before config_init */
  int32_t linkState = LAN8742_GetLinkState(&lan8742);
  g_soemErrorCode = 360;  /* PHY link check: 36% = link down */
  if (linkState > LAN8742_STATUS_LINK_DOWN)
  {
    g_soemErrorCode = 360 + linkState * 10;  /* 370=10M HD, 380=10M FD, 390=100M HD, 400=100M FD */
  }

  osDelay(100);  /* Small delay before config_init */

  /* Find and configure slaves */
  int slaveCount = ecx_config_init(&ecatContext);
  g_soemErrorCode = 450;  /* config_init returned (display 45%) */
  if (slaveCount > 0)
  {
    g_slaveCount = ecatContext.slavecount;
    g_soemInitStatus = 1;  /* OK */
    g_soemErrorCode = 470 + g_slaveCount;  /* 471=1 slave, 472=2 slaves, etc (47%) */

    /* === Step 1: Transition to PRE_OP (like Linux code) === */
    g_soemErrorCode = 480;  /* Requesting PRE_OP (48%) */
    ecatContext.slavelist[0].state = EC_STATE_PRE_OP;
    ecx_writestate(&ecatContext, 0);
    
    int preop_timeout = 2000;
    while (ecx_statecheck(&ecatContext, 0, EC_STATE_PRE_OP, 50000) != EC_STATE_PRE_OP && preop_timeout > 0)
    {
      preop_timeout--;
    }
    
    if (preop_timeout <= 0)
    {
      g_soemInitStatus = 2;
      g_soemErrorCode = 481;  /* PRE_OP timeout */
      goto error_loop;
    }
    
    g_soemErrorCode = 490;  /* PRE_OP reached, mapping PDO (49%) */
    
    /* === Step 2: Map process data (in PRE_OP state) === */
    ecx_config_map_group(&ecatContext, IOmap, 0);

    /* Configure DC if needed */
    ecx_configdc(&ecatContext);

    /* === Step 3: Transition to SAFE_OP === */
    g_soemErrorCode = 500;  /* Requesting SAFE_OP (50%) */

    /* Request all slaves to SAFE_OP state */
    ecatContext.slavelist[0].state = EC_STATE_SAFE_OP;
    ecx_writestate(&ecatContext, 0);

    /* Wait for SAFE_OP state */
    int timeout = 4000;
    while (ecx_statecheck(&ecatContext, 0, EC_STATE_SAFE_OP, 50000) != EC_STATE_SAFE_OP && timeout > 0)
    {
      timeout--;
    }

    if (timeout > 0)
    {
      g_soemErrorCode = 600;  /* SAFE_OP reached, requesting OP (60%) */

      /* Request OPERATIONAL state */
      ecatContext.slavelist[0].state = EC_STATE_OPERATIONAL;
      ecx_writestate(&ecatContext, 0);

      g_soemErrorCode = 700;  /* OP requested, entering loop (70%) */

