stardio/STM32_Ethercat_AGV/Appli/Core/Src/main.c
      /* Cyclic processing loop */
      for(;;)
      {
        ecx_send_processdata(&ecatContext);
        ecx_receive_processdata(&ecatContext, EC_TIMEOUTRET);
        g_soemErrorCode = 800;  /* Running OK (80%) */
        osDelay(1);  /* ~1ms cycle time */
      }
    }
    else
    {
      g_soemInitStatus = 2;  /* Error - state transition failed */
      g_soemErrorCode = 550;  /* SAFE_OP timeout (55%) */
    }
  }
  else
  {
    g_slaveCount = 0;
    g_soemInitStatus = 2;  /* Error - no slaves found */
    g_soemErrorCode = 460;  /* config_init returned 0 - no slaves (46%) */
  }

error_loop:
  /* Stay in error loop - cycle through debug info */
  /* Phase 0: last error code (original)
   * Phase 1: detect_step (add 1300) - shows step within detect_slaves
   * Phase 2: sockhandle value (add 1400) - actual sockhandle value
   * Phase 3: BWR count (add 600)
   */
  {
    uint32_t last_err = g_soemErrorCode;
    uint32_t phase = 0;
    for(;;)
    {
      switch(phase)
      {
        case 0:
          g_soemErrorCode = last_err;  /* Original error */
          break;
        case 1:
          g_soemErrorCode = 1300 + (g_soem_detect_step % 100);  /* 1301-1399 = detect step */
          break;
        case 2:
          /* Show sockhandle: 1400 + value. If negative, show 1400 - abs(value) */
          if (g_soem_sockhandle_value >= 0)
            g_soemErrorCode = 1400 + (g_soem_sockhandle_value % 100);
          else
            g_soemErrorCode = 1400;  /* 1400 = still default -999 or 0 */
          break;
        case 3:
          g_soemErrorCode = 600 + (g_soem_bwr_count % 100);  /* 600-699 = BWR count */
          break;
      }
      phase = (phase + 1) % 4;
      osDelay(2000);  /* 2 seconds per phase */
    }
  }
}

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void *argument)
{
  /* USER CODE BEGIN 5 */
  char wifiMsg[240];
  const char* wifiDiag;
  int32_t wifiDiagCode;

#if WIFI_SPI4_LOOPBACK_TEST
  UART4_SendText("[WIFI] SPI4 loopback mode start (set SB2/SB6/SB8 ON, short CN3 pin2(PE14 MOSI)<->pin3(PE13 MISO))\r\n");
  WIFI_SPI4_LoopbackSelfTest();
  UART4_SendText("[WIFI] SPI4 loopback mode done, Wi-Fi init skipped\r\n");
  for(;;)
  {
    osDelay(1000);
  }
#endif

  /* MB1400 UART mode uses UART7 on STM32H7S78-DK STMod+ routing. */
  UART4_SendText("[WIFI] init starting (UART7 AT sync ~14s timeout)...\r\n");
  WIFI_UART7_LoopbackSelfTest();
  WIFI_UART7_QuickAtProbe();
  Emw3080WebServer_Init();

  wifiDiag = Emw3080WebServer_GetDiagMessage();
  if (wifiDiag == NULL)
  {
    wifiDiag = "n/a";
  }

  wifiDiagCode = Emw3080WebServer_GetDiagCode();
  if (Emw3080WebServer_IsRunning() != 0U)
  {
    (void)snprintf(wifiMsg,
                   sizeof(wifiMsg),
                   "[WIFI] AP up code=%ld uart=%lu baud=%lu mux=%u msg=%s\r\n",
                   (long)wifiDiagCode,
                   (unsigned long)Emw3080WebServer_GetDiagActiveUart(),
                   (unsigned long)Emw3080WebServer_GetDiagBaud(),
                   (unsigned int)Emw3080WebServer_GetDiagMultiConnMode(),
                   wifiDiag);
  }
  else
  {
    (void)snprintf(wifiMsg,
                   sizeof(wifiMsg),
                   "[WIFI] AP failed code=%ld uart=%lu msg=%s (check SB1/SB5/SB7 and UART7 PE7/PE8 route)\r\n",
                   (long)wifiDiagCode,
                   (unsigned long)Emw3080WebServer_GetDiagActiveUart(),
                   wifiDiag);
  }
  UART4_SendText(wifiMsg);

  /* Infinite loop */
  for(;;)
  {
    if (Emw3080WebServer_IsRunning() != 0U)
    {
      Emw3080WebServer_SetCurrentPosition(SOEM_GetPositionActual());
      Emw3080WebServer_Process();
    }
    osDelay(10);
  }
  /* USER CODE END 5 */
}

 /* MPU Configuration */

static void MPU_Config(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct = {0};

  /* Disables the MPU */
  HAL_MPU_Disable();

  /* Disables all MPU regions */
  for(uint8_t i=0; i<__MPU_REGIONCOUNT; i++)
  {
    HAL_MPU_DisableRegion(i);
  }

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER0;
  MPU_InitStruct.BaseAddress = 0x0;
  MPU_InitStruct.Size = MPU_REGION_SIZE_4GB;
  MPU_InitStruct.SubRegionDisable = 0x87;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.AccessPermission = MPU_REGION_NO_ACCESS;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Number = MPU_REGION_NUMBER1;
  MPU_InitStruct.BaseAddress = 0x70000000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_128MB;
  MPU_InitStruct.SubRegionDisable = 0x0;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL1;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_CACHEABLE;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_BUFFERABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Number = MPU_REGION_NUMBER2;
  MPU_InitStruct.Size = MPU_REGION_SIZE_2MB;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Number = MPU_REGION_NUMBER3;
  MPU_InitStruct.BaseAddress = 0x90000000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_32MB;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

